export const ChinaAreas =
 [
    {
      text: "北京",
      children: [
        {
          text: "北京"
        }
      ]
    },
    {
      text: "上海",
      children: [
        {
          text: "上海"
        }
      ]
    },
    {
      text: "重庆",
      children: [
        {
          text: "重庆"
        }
      ]
    },
    {
      text: "天津",
      children: [
        {
          text: "天津"
        }
      ]
    },
    {
      text: "广东",
      children: [
        {
          text: "广州"
        },
        {
          text: "深圳"
        },
        {
          text: "珠海"
        },
        {
          text: "汕头"
        },
        {
          text: "韶关"
        },
        {
          text: "佛山"
        },
        {
          text: "江门"
        },
        {
          text: "湛江"
        },
        {
          text: "茂名"
        },
        {
          text: "肇庆"
        },
        {
          text: "惠州"
        },
        {
          text: "梅州"
        },
        {
          text: "汕尾"
        },
        {
          text: "河源"
        },
        {
          text: "阳江"
        },
        {
          text: "清远"
        },
        {
          text: "东莞"
        },
        {
          text: "中山"
        },
        {
          text: "潮州"
        },
        {
          text: "揭阳"
        },
        {
          text: "云浮"
        },
        {
          text: "其他"
        }
      ]
    },
    {
      text: "辽宁",
      children: [
        {
          text: "沈阳"
        },
        {
          text: "大连"
        },
        {
          text: "鞍山"
        },
        {
          text: "抚顺"
        },
        {
          text: "本溪"
        },
        {
          text: "丹东"
        },
        {
          text: "锦州"
        },
        {
          text: "营口"
        },
        {
          text: "阜新"
        },
        {
          text: "辽阳"
        },
        {
          text: "盘锦"
        },
        {
          text: "铁岭"
        },
        {
          text: "朝阳"
        },
        {
          text: "葫芦岛"
        },
        {
          text: "其他"
        }
      ]
    },
    {
      text: "江苏",
      children: [
        {
          text: "南京"
        },
        {
          text: "苏州"
        },
        {
          text: "无锡"
        },
        {
          text: "常州"
        },
        {
          text: "镇江"
        },
        {
          text: "南通"
        },
        {
          text: "泰州"
        },
        {
          text: "扬州"
        },
        {
          text: "盐城"
        },
        {
          text: "连云港"
        },
        {
          text: "徐州"
        },
        {
          text: "淮安"
        },
        {
          text: "宿迁"
        },
        {
          text: "其他"
        }
      ]
    },
    {
      text: "湖北",
      children: [
        {
          text: "武汉"
        },
        {
          text: "黄石"
        },
        {
          text: "十堰"
        },
        {
          text: "荆州"
        },
        {
          text: "宜昌"
        },
        {
          text: "襄阳"
        },
        {
          text: "鄂州"
        },
        {
          text: "荆门"
        },
        {
          text: "孝感"
        },
        {
          text: "黄冈"
        },
        {
          text: "咸宁"
        },
        {
          text: "随州"
        },
        {
          text: "恩施土家族苗族自治州"
        },
        {
          text: "仙桃"
        },
        {
          text: "天门"
        },
        {
          text: "潜江"
        },
        {
          text: "神农架林区"
        },
        {
          text: "其他"
        }
      ]
    },
    {
      text: "四川",
      children: [
        {
          text: "成都"
        },
        {
          text: "自贡"
        },
        {
          text: "攀枝花"
        },
        {
          text: "泸州"
        },
        {
          text: "德阳"
        },
        {
          text: "绵阳"
        },
        {
          text: "广元"
        },
        {
          text: "遂宁"
        },
        {
          text: "内江"
        },
        {
          text: "乐山"
        },
        {
          text: "南充"
        },
        {
          text: "眉山"
        },
        {
          text: "宜宾"
        },
        {
          text: "广安"
        },
        {
          text: "达州"
        },
        {
          text: "雅安"
        },
        {
          text: "巴中"
        },
        {
          text: "资阳"
        },
        {
          text: "阿坝藏族羌族自治州"
        },
        {
          text: "甘孜藏族自治州"
        },
        {
          text: "凉山彝族自治州"
        },
        {
          text: "其他"
        }
      ]
    },
    {
      text: "陕西",
      children: [
        {
          text: "西安"
        },
        {
          text: "铜川"
        },
        {
          text: "宝鸡"
        },
        {
          text: "咸阳"
        },
        {
          text: "渭南"
        },
        {
          text: "延安"
        },
        {
          text: "汉中"
        },
        {
          text: "榆林"
        },
        {
          text: "安康"
        },
        {
          text: "商洛"
        },
        {
          text: "其他"
        }
      ]
    },
    {
      text: "河北",
      children: [
        {
          text: "石家庄"
        },
        {
          text: "唐山"
        },
        {
          text: "秦皇岛"
        },
        {
          text: "邯郸"
        },
        {
          text: "邢台"
        },
        {
          text: "保定"
        },
        {
          text: "张家口"
        },
        {
          text: "承德"
        },
        {
          text: "沧州"
        },
        {
          text: "廊坊"
        },
        {
          text: "衡水"
        },
        {
          text: "其他"
        }
      ]
    },
    {
      text: "山西",
      children: [
        {
          text: "太原"
        },
        {
          text: "大同"
        },
        {
          text: "阳泉"
        },
        {
          text: "长治"
        },
        {
          text: "晋城"
        },
        {
          text: "朔州"
        },
        {
          text: "晋中"
        },
        {
          text: "运城"
        },
        {
          text: "忻州"
        },
        {
          text: "临汾"
        },
        {
          text: "吕梁"
        },
        {
          text: "其他"
        }
      ]
    },
    {
      text: "河南",
      children: [
        {
          text: "郑州"
        },
        {
          text: "开封"
        },
        {
          text: "洛阳"
        },
        {
          text: "平顶山"
        },
        {
          text: "安阳"
        },
        {
          text: "鹤壁"
        },
        {
          text: "新乡"
        },
        {
          text: "焦作"
        },
        {
          text: "濮阳"
        },
        {
          text: "许昌"
        },
        {
          text: "漯河"
        },
        {
          text: "三门峡"
        },
        {
          text: "南阳"
        },
        {
          text: "商丘"
        },
        {
          text: "信阳"
        },
        {
          text: "周口"
        },
        {
          text: "驻马店"
        },
        {
          text: "焦作"
        },
        {
          text: "济源"
        },
        {
          text: "其他"
        }
      ]
    },
    {
      text: "吉林",
      children: [
        {
          text: "长春"
        },
        {
          text: "吉林"
        },
        {
          text: "四平"
        },
        {
          text: "辽源"
        },
        {
          text: "通化"
        },
        {
          text: "白山"
        },
        {
          text: "松原"
        },
        {
          text: "白城"
        },
        {
          text: "梅河口"
        },
        {
          text: "延边朝鲜族自治州"
        },
        {
          text: "其他"
        }
      ]
    },
    {
      text: "黑龙江",
      children: [
        {
          text: "哈尔滨"
        },
        {
          text: "齐齐哈尔"
        },
        {
          text: "鹤岗"
        },
        {
          text: "双鸭山"
        },
        {
          text: "鸡西"
        },
        {
          text: "大庆"
        },
        {
          text: "伊春"
        },
        {
          text: "牡丹江"
        },
        {
          text: "佳木斯"
        },
        {
          text: "七台河"
        },
        {
          text: "黑河"
        },
        {
          text: "绥化"
        },
        {
          text: "大兴安岭地区"
        },
        {
          text: "其他"
        }
      ]
    },
    {
      text: "内蒙古",
      children: [
        {
          text: "呼和浩特"
        },
        {
          text: "包头"
        },
        {
          text: "乌海"
        },
        {
          text: "赤峰"
        },
        {
          text: "通辽"
        },
        {
          text: "鄂尔多斯"
        },
        {
          text: "呼伦贝尔"
        },
        {
          text: "巴彦淖尔"
        },
        {
          text: "乌兰察布"
        },
        {
          text: "锡林郭勒盟"
        },
        {
          text: "兴安盟"
        },
        {
          text: "阿拉善盟"
        },
        {
          text: "其他"
        }
      ]
    },
    {
      text: "山东",
      children: [
        {
          text: "济南"
        },
        {
          text: "青岛"
        },
        {
          text: "淄博"
        },
        {
          text: "枣庄"
        },
        {
          text: "东营"
        },
        {
          text: "烟台"
        },
        {
          text: "潍坊"
        },
        {
          text: "济宁"
        },
        {
          text: "泰安"
        },
        {
          text: "威海"
        },
        {
          text: "日照"
        },
        {
          text: "莱芜"
        },
        {
          text: "临沂"
        },
        {
          text: "德州"
        },
        {
          text: "聊城"
        },
        {
          text: "滨州"
        },
        {
          text: "菏泽"
        },
        {
          text: "其他"
        }
      ]
    },
    {
      text: "安徽",
      children: [
        {
          text: "合肥"
        },
        {
          text: "芜湖"
        },
        {
          text: "蚌埠"
        },
        {
          text: "淮南"
        },
        {
          text: "马鞍山"
        },
        {
          text: "淮北"
        },
        {
          text: "铜陵"
        },
        {
          text: "安庆"
        },
        {
          text: "黄山"
        },
        {
          text: "滁州"
        },
        {
          text: "阜阳"
        },
        {
          text: "宿州"
        },
        {
          text: "巢湖"
        },
        {
          text: "六安"
        },
        {
          text: "亳州"
        },
        {
          text: "池州"
        },
        {
          text: "宣城"
        },
        {
          text: "其他"
        }
      ]
    },
    {
      text: "浙江",
      children: [
        {
          text: "杭州"
        },
        {
          text: "宁波"
        },
        {
          text: "温州"
        },
        {
          text: "嘉兴"
        },
        {
          text: "湖州"
        },
        {
          text: "绍兴"
        },
        {
          text: "金华"
        },
        {
          text: "衢州"
        },
        {
          text: "舟山"
        },
        {
          text: "台州"
        },
        {
          text: "丽水"
        },
        {
          text: "其他"
        }
      ]
    },
    {
      text: "福建",
      children: [
        {
          text: "福州"
        },
        {
          text: "厦门"
        },
        {
          text: "莆田"
        },
        {
          text: "三明"
        },
        {
          text: "泉州"
        },
        {
          text: "漳州"
        },
        {
          text: "南平"
        },
        {
          text: "龙岩"
        },
        {
          text: "宁德"
        },
        {
          text: "其他"
        }
      ]
    },
    {
      text: "湖南",
      children: [
        {
          text: "长沙"
        },
        {
          text: "株洲"
        },
        {
          text: "湘潭"
        },
        {
          text: "衡阳"
        },
        {
          text: "邵阳"
        },
        {
          text: "岳阳"
        },
        {
          text: "常德"
        },
        {
          text: "张家界"
        },
        {
          text: "益阳"
        },
        {
          text: "郴州"
        },
        {
          text: "永州"
        },
        {
          text: "怀化"
        },
        {
          text: "娄底"
        },
        {
          text: "湘西土家族苗族自治州"
        },
        {
          text: "其他"
        }
      ]
    },
    {
      text: "广西",
      children: [
        {
          text: "南宁"
        },
        {
          text: "柳州"
        },
        {
          text: "桂林"
        },
        {
          text: "梧州"
        },
        {
          text: "北海"
        },
        {
          text: "防城港"
        },
        {
          text: "钦州"
        },
        {
          text: "贵港"
        },
        {
          text: "玉林"
        },
        {
          text: "百色"
        },
        {
          text: "贺州"
        },
        {
          text: "河池"
        },
        {
          text: "来宾"
        },
        {
          text: "崇左"
        },
        {
          text: "其他"
        }
      ]
    },
    {
      text: "江西",
      children: [
        {
          text: "南昌"
        },
        {
          text: "景德镇"
        },
        {
          text: "萍乡"
        },
        {
          text: "九江"
        },
        {
          text: "新余"
        },
        {
          text: "鹰潭"
        },
        {
          text: "赣州"
        },
        {
          text: "吉安"
        },
        {
          text: "宜春"
        },
        {
          text: "抚州"
        },
        {
          text: "上饶"
        },
        {
          text: "其他"
        }
      ]
    },
    {
      text: "贵州",
      children: [
        {
          text: "贵阳"
        },
        {
          text: "六盘水"
        },
        {
          text: "遵义"
        },
        {
          text: "安顺"
        },
        {
          text: "铜仁"
        },
        {
          text: "毕节"
        },
        {
          text: "黔西南布依族苗族自治州"
        },
        {
          text: "黔东南苗族侗族自治州"
        },
        {
          text: "黔南布依族苗族自治州"
        },
        {
          text: "其他"
        }
      ]
    },
    {
      text: "云南",
      children: [
        {
          text: "昆明"
        },
        {
          text: "曲靖"
        },
        {
          text: "玉溪"
        },
        {
          text: "保山"
        },
        {
          text: "昭通"
        },
        {
          text: "丽江"
        },
        {
          text: "普洱"
        },
        {
          text: "临沧"
        },
        {
          text: "德宏傣族景颇族自治州"
        },
        {
          text: "怒江傈僳族自治州"
        },
        {
          text: "迪庆藏族自治州"
        },
        {
          text: "大理白族自治州"
        },
        {
          text: "楚雄彝族自治州"
        },
        {
          text: "红河哈尼族彝族自治州"
        },
        {
          text: "文山壮族苗族自治州"
        },
        {
          text: "西双版纳傣族自治州"
        },
        {
          text: "其他"
        }
      ]
    },
    {
      text: "西藏",
      children: [
        {
          text: "拉萨"
        },
        {
          text: "那曲地区"
        },
        {
          text: "昌都"
        },
        {
          text: "林芝"
        },
        {
          text: "山南"
        },
        {
          text: "日喀则"
        },
        {
          text: "阿里地区"
        },
        {
          text: "其他"
        }
      ]
    },
    {
      text: "海南",
      children: [
        {
          text: "海口"
        },
        {
          text: "三亚"
        },
        {
          text: "五指山"
        },
        {
          text: "琼海"
        },
        {
          text: "儋州"
        },
        {
          text: "文昌"
        },
        {
          text: "万宁"
        },
        {
          text: "东方"
        },
        {
          text: "澄迈县"
        },
        {
          text: "定安县"
        },
        {
          text: "屯昌县"
        },
        {
          text: "临高县"
        },
        {
          text: "白沙黎族自治县"
        },
        {
          text: "昌江黎族自治县"
        },
        {
          text: "乐东黎族自治县"
        },
        {
          text: "陵水黎族自治县"
        },
        {
          text: "保亭黎族苗族自治县"
        },
        {
          text: "琼中黎族苗族自治县"
        },
        {
          text: "其他"
        }
      ]
    },
    {
      text: "甘肃",
      children: [
        {
          text: "兰州"
        },
        {
          text: "嘉峪关"
        },
        {
          text: "金昌"
        },
        {
          text: "白银"
        },
        {
          text: "天水"
        },
        {
          text: "武威"
        },
        {
          text: "酒泉"
        },
        {
          text: "张掖"
        },
        {
          text: "庆阳"
        },
        {
          text: "平凉"
        },
        {
          text: "定西"
        },
        {
          text: "陇南"
        },
        {
          text: "临夏回族自治州"
        },
        {
          text: "甘南藏族自治州"
        },
        {
          text: "其他"
        }
      ]
    },
    {
      text: "宁夏",
      children: [
        {
          text: "银川"
        },
        {
          text: "石嘴山"
        },
        {
          text: "吴忠"
        },
        {
          text: "固原"
        },
        {
          text: "中卫"
        },
        {
          text: "其他"
        }
      ]
    },
    {
      text: "青海",
      children: [
        {
          text: "西宁"
        },
        {
          text: "海东"
        },
        {
          text: "海北藏族自治州"
        },
        {
          text: "海南藏族自治州"
        },
        {
          text: "黄南藏族自治州"
        },
        {
          text: "果洛藏族自治州"
        },
        {
          text: "玉树藏族自治州"
        },
        {
          text: "海西蒙古族藏族自治州"
        },
        {
          text: "其他"
        }
      ]
    },
    {
      text: "新疆",
      children: [
        {
          text: "乌鲁木齐"
        },
        {
          text: "克拉玛依"
        },
        {
          text: "吐鲁番"
        },
        {
          text: "哈密"
        },
        {
          text: "和田地区"
        },
        {
          text: "阿克苏地区"
        },
        {
          text: "喀什地区"
        },
        {
          text: "克孜勒苏柯尔克孜自治州"
        },
        {
          text: "巴音郭楞蒙古自治州"
        },
        {
          text: "昌吉回族自治州"
        },
        {
          text: "博尔塔拉蒙古自治州"
        },
        {
          text: "石河子"
        },
        {
          text: "阿拉尔"
        },
        {
          text: "图木舒克"
        },
        {
          text: "五家渠"
        },
        {
          text: "伊犁哈萨克自治州"
        },
        {
          text: "阿勒泰地区"
        },
        {
          text: "塔城地区"
        },
        {
          text: "其他"
        }
      ]
    },
    {
      text: "香港",
      children: [
        {
          text: "香港"
        }
      ]
    },
    {
      text: "澳门",
      children: [
        {
          text: "澳门"
        }
      ]
    },
    {
      text: "台湾",
      children: [
        {
          text: "台湾"
        }
      ]
    },
    {
      text: "海外",
      children: [
        {
          text: "其他"
        }
      ]
    },
    {
      text: "其他"
    }
  ];

export const Area = [
  {
    "cities": [
      {
        "code": "101010200",
        "name": "北京"
      }
    ],
    "code": "101010200",
    "name": "北京"
  },
  {
    "cities": [
      {
        "code": "101020200",
        "name": "上海"
      }
    ],
    "code": "101020200",
    "name": "上海"
  },
  {
    "cities": [
      {
        "code": "101030200",
        "name": "天津"
      }
    ],
    "code": "101030200",
    "name": "天津"
  },
  {
    "cities": [
      {
        "code": "101040200",
        "name": "重庆"
      }
    ],
    "code": "101040200",
    "name": "重庆"
  },
  {
    "cities": [
      {
        "code": "101050101",
        "name": "哈尔滨"
      },
      {
        "code": "101050201",
        "name": "齐齐哈尔"
      },
      {
        "code": "101050301",
        "name": "牡丹江"
      },
      {
        "code": "101050401",
        "name": "佳木斯"
      },
      {
        "code": "101050501",
        "name": "绥化"
      },
      {
        "code": "101050601",
        "name": "黑河"
      },
      {
        "code": "101050701",
        "name": "大兴安岭"
      },
      {
        "code": "101050801",
        "name": "伊春"
      },
      {
        "code": "101050901",
        "name": "大庆"
      },
      {
        "code": "101051002",
        "name": "七台河"
      },
      {
        "code": "101051101",
        "name": "鸡西"
      },
      {
        "code": "101051201",
        "name": "鹤岗"
      },
      {
        "code": "101051301",
        "name": "双鸭山"
      }
    ],
    "code": "101050101",
    "name": "黑龙江"
  },
  {
    "cities": [
      {
        "code": "101060101",
        "name": "长春"
      },
      {
        "code": "101060201",
        "name": "吉林"
      },
      {
        "code": "101060301",
        "name": "延边"
      },
      {
        "code": "101060401",
        "name": "四平"
      },
      {
        "code": "101060501",
        "name": "通化"
      },
      {
        "code": "101060601",
        "name": "白城"
      },
      {
        "code": "101060701",
        "name": "辽源"
      },
      {
        "code": "101060801",
        "name": "松原"
      },
      {
        "code": "101060901",
        "name": "白山"
      }
    ],
    "code": "101060101",
    "name": "吉林"
  },
  {
    "cities": [
      {
        "code": "101070101",
        "name": "沈阳"
      },
      {
        "code": "101070201",
        "name": "大连"
      },
      {
        "code": "101070301",
        "name": "鞍山"
      },
      {
        "code": "101070401",
        "name": "抚顺"
      },
      {
        "code": "101070501",
        "name": "本溪"
      },
      {
        "code": "101070601",
        "name": "丹东"
      },
      {
        "code": "101070701",
        "name": "锦州"
      },
      {
        "code": "101070801",
        "name": "营口"
      },
      {
        "code": "101070901",
        "name": "阜新"
      },
      {
        "code": "101071001",
        "name": "辽阳"
      },
      {
        "code": "101071101",
        "name": "铁岭"
      },
      {
        "code": "101071201",
        "name": "朝阳"
      },
      {
        "code": "101071301",
        "name": "盘锦"
      },
      {
        "code": "101071401",
        "name": "葫芦岛"
      }
    ],
    "code": "101070101",
    "name": "辽宁"
  },
  {
    "cities": [
      {
        "code": "101080101",
        "name": "呼和浩特"
      },
      {
        "code": "101080201",
        "name": "包头"
      },
      {
        "code": "101080301",
        "name": "乌海"
      },
      {
        "code": "101080401",
        "name": "乌兰察布"
      },
      {
        "code": "101080501",
        "name": "通辽"
      },
      {
        "code": "101080510",
        "name": "兴安盟"
      },
      {
        "code": "101080511",
        "name": "通辽"
      },
      {
        "code": "101080601",
        "name": "赤峰"
      },
      {
        "code": "101080701",
        "name": "鄂尔多斯"
      },
      {
        "code": "101080801",
        "name": "巴彦淖尔"
      },
      {
        "code": "101080901",
        "name": "锡林郭勒"
      },
      {
        "code": "101081000",
        "name": "呼伦贝尔"
      },
      {
        "code": "101081101",
        "name": "兴安盟"
      },
      {
        "code": "101081108",
        "name": "通辽"
      },
      {
        "code": "101081109",
        "name": "兴安盟"
      },
      {
        "code": "101081201",
        "name": "阿拉善盟"
      }
    ],
    "code": "101080101",
    "name": "内蒙古"
  },
  {
    "cities": [
      {
        "code": "101090101",
        "name": "石家庄"
      },
      {
        "code": "101090201",
        "name": "保定"
      },
      {
        "code": "101090301",
        "name": "张家口"
      },
      {
        "code": "101090402",
        "name": "承德"
      },
      {
        "code": "101090501",
        "name": "唐山"
      },
      {
        "code": "101090601",
        "name": "廊坊"
      },
      {
        "code": "101090701",
        "name": "沧州"
      },
      {
        "code": "101090801",
        "name": "衡水"
      },
      {
        "code": "101090901",
        "name": "邢台"
      },
      {
        "code": "101091001",
        "name": "邯郸"
      },
      {
        "code": "101091101",
        "name": "秦皇岛"
      }
    ],
    "code": "101090101",
    "name": "河北"
  },
  {
    "cities": [
      {
        "code": "101100101",
        "name": "太原"
      },
      {
        "code": "101100201",
        "name": "大同"
      },
      {
        "code": "101100301",
        "name": "阳泉"
      },
      {
        "code": "101100401",
        "name": "晋中"
      },
      {
        "code": "101100501",
        "name": "长治"
      },
      {
        "code": "101100601",
        "name": "晋城"
      },
      {
        "code": "101100701",
        "name": "临汾"
      },
      {
        "code": "101100801",
        "name": "运城"
      },
      {
        "code": "101100901",
        "name": "朔州"
      },
      {
        "code": "101101001",
        "name": "忻州"
      },
      {
        "code": "101101100",
        "name": "吕梁"
      }
    ],
    "code": "101100101",
    "name": "山西"
  },
  {
    "cities": [
      {
        "code": "101110101",
        "name": "西安"
      },
      {
        "code": "101110200",
        "name": "咸阳"
      },
      {
        "code": "101110300",
        "name": "延安"
      },
      {
        "code": "101110401",
        "name": "榆林"
      },
      {
        "code": "101110501",
        "name": "渭南"
      },
      {
        "code": "101110601",
        "name": "商洛"
      },
      {
        "code": "101110701",
        "name": "安康"
      },
      {
        "code": "101110801",
        "name": "汉中"
      },
      {
        "code": "101110901",
        "name": "宝鸡"
      },
      {
        "code": "101111001",
        "name": "铜川"
      },
      {
        "code": "101111101",
        "name": "杨凌"
      }
    ],
    "code": "101110101",
    "name": "陕西"
  },
  {
    "cities": [
      {
        "code": "101120101",
        "name": "济南"
      },
      {
        "code": "101120201",
        "name": "青岛"
      },
      {
        "code": "101120301",
        "name": "淄博"
      },
      {
        "code": "101120401",
        "name": "德州"
      },
      {
        "code": "101120501",
        "name": "烟台"
      },
      {
        "code": "101120601",
        "name": "潍坊"
      },
      {
        "code": "101120701",
        "name": "济宁"
      },
      {
        "code": "101120801",
        "name": "泰安"
      },
      {
        "code": "101120901",
        "name": "临沂"
      },
      {
        "code": "101121001",
        "name": "菏泽"
      },
      {
        "code": "101121101",
        "name": "滨州"
      },
      {
        "code": "101121201",
        "name": "东营"
      },
      {
        "code": "101121301",
        "name": "威海"
      },
      {
        "code": "101121401",
        "name": "枣庄"
      },
      {
        "code": "101121501",
        "name": "日照"
      },
      {
        "code": "101121601",
        "name": "莱芜"
      },
      {
        "code": "101121701",
        "name": "聊城"
      }
    ],
    "code": "101120101",
    "name": "山东"
  },
  {
    "cities": [
      {
        "code": "101130101",
        "name": "乌鲁木齐"
      },
      {
        "code": "101130201",
        "name": "克拉玛依"
      },
      {
        "code": "101130301",
        "name": "石河子"
      },
      {
        "code": "101130401",
        "name": "昌吉"
      },
      {
        "code": "101130501",
        "name": "吐鲁番"
      },
      {
        "code": "101130601",
        "name": "巴音郭楞"
      },
      {
        "code": "101130701",
        "name": "阿拉尔"
      },
      {
        "code": "101130801",
        "name": "阿克苏"
      },
      {
        "code": "101130901",
        "name": "喀什"
      },
      {
        "code": "101131001",
        "name": "伊犁"
      },
      {
        "code": "101131101",
        "name": "塔城"
      },
      {
        "code": "101131201",
        "name": "哈密"
      },
      {
        "code": "101131301",
        "name": "和田"
      },
      {
        "code": "101131401",
        "name": "阿勒泰"
      },
      {
        "code": "101131501",
        "name": "克州"
      },
      {
        "code": "101131601",
        "name": "博尔塔拉"
      }
    ],
    "code": "101130101",
    "name": "新疆"
  },
  {
    "cities": [
      {
        "code": "101140101",
        "name": "拉萨"
      },
      {
        "code": "101140201",
        "name": "日喀则"
      },
      {
        "code": "101140301",
        "name": "山南"
      },
      {
        "code": "101140401",
        "name": "林芝"
      },
      {
        "code": "101140501",
        "name": "昌都"
      },
      {
        "code": "101140601",
        "name": "那曲"
      },
      {
        "code": "101140701",
        "name": "阿里"
      }
    ],
    "code": "101140101",
    "name": "西藏"
  },
  {
    "cities": [
      {
        "code": "101150101",
        "name": "西宁"
      },
      {
        "code": "101150201",
        "name": "海东"
      },
      {
        "code": "101150301",
        "name": "黄南"
      },
      {
        "code": "101150401",
        "name": "海南"
      },
      {
        "code": "101150501",
        "name": "果洛"
      },
      {
        "code": "101150601",
        "name": "玉树"
      },
      {
        "code": "101150701",
        "name": "海西"
      },
      {
        "code": "101150801",
        "name": "海北"
      },
      {
        "code": "101150901",
        "name": "格尔木"
      }
    ],
    "code": "101150101",
    "name": "青海"
  },
  {
    "cities": [
      {
        "code": "101160101",
        "name": "兰州"
      },
      {
        "code": "101160201",
        "name": "定西"
      },
      {
        "code": "101160301",
        "name": "平凉"
      },
      {
        "code": "101160401",
        "name": "庆阳"
      },
      {
        "code": "101160501",
        "name": "武威"
      },
      {
        "code": "101160601",
        "name": "金昌"
      },
      {
        "code": "101160701",
        "name": "张掖"
      },
      {
        "code": "101160801",
        "name": "酒泉"
      },
      {
        "code": "101160901",
        "name": "天水"
      },
      {
        "code": "101161001",
        "name": "陇南"
      },
      {
        "code": "101161101",
        "name": "临夏"
      },
      {
        "code": "101161201",
        "name": "甘南"
      },
      {
        "code": "101161301",
        "name": "白银"
      },
      {
        "code": "101161401",
        "name": "嘉峪关"
      }
    ],
    "code": "101160101",
    "name": "甘肃"
  },
  {
    "cities": [
      {
        "code": "101170101",
        "name": "银川"
      },
      {
        "code": "101170201",
        "name": "石嘴山"
      },
      {
        "code": "101170301",
        "name": "吴忠"
      },
      {
        "code": "101170401",
        "name": "固原"
      },
      {
        "code": "101170501",
        "name": "中卫"
      }
    ],
    "code": "101170101",
    "name": "宁夏"
  },
  {
    "cities": [
      {
        "code": "101180101",
        "name": "郑州"
      },
      {
        "code": "101180201",
        "name": "安阳"
      },
      {
        "code": "101180301",
        "name": "新乡"
      },
      {
        "code": "101180401",
        "name": "许昌"
      },
      {
        "code": "101180501",
        "name": "平顶山"
      },
      {
        "code": "101180601",
        "name": "信阳"
      },
      {
        "code": "101180701",
        "name": "南阳"
      },
      {
        "code": "101180801",
        "name": "开封"
      },
      {
        "code": "101180901",
        "name": "洛阳"
      },
      {
        "code": "101181001",
        "name": "商丘"
      },
      {
        "code": "101181101",
        "name": "焦作"
      },
      {
        "code": "101181201",
        "name": "鹤壁"
      },
      {
        "code": "101181301",
        "name": "濮阳"
      },
      {
        "code": "101181401",
        "name": "周口"
      },
      {
        "code": "101181501",
        "name": "漯河"
      },
      {
        "code": "101181601",
        "name": "驻马店"
      },
      {
        "code": "101181701",
        "name": "三门峡"
      },
      {
        "code": "101181801",
        "name": "济源"
      }
    ],
    "code": "101180101",
    "name": "河南"
  },
  {
    "cities": [
      {
        "code": "101190101",
        "name": "南京"
      },
      {
        "code": "101190201",
        "name": "无锡"
      },
      {
        "code": "101190301",
        "name": "镇江"
      },
      {
        "code": "101190401",
        "name": "苏州"
      },
      {
        "code": "101190501",
        "name": "南通"
      },
      {
        "code": "101190601",
        "name": "扬州"
      },
      {
        "code": "101190701",
        "name": "盐城"
      },
      {
        "code": "101190801",
        "name": "徐州"
      },
      {
        "code": "101190901",
        "name": "淮安"
      },
      {
        "code": "101191001",
        "name": "连云港"
      },
      {
        "code": "101191101",
        "name": "常州"
      },
      {
        "code": "101191201",
        "name": "泰州"
      },
      {
        "code": "101191301",
        "name": "宿迁"
      }
    ],
    "code": "101190101",
    "name": "江苏"
  },
  {
    "cities": [
      {
        "code": "101200101",
        "name": "武汉"
      },
      {
        "code": "101200201",
        "name": "襄阳"
      },
      {
        "code": "101200301",
        "name": "鄂州"
      },
      {
        "code": "101200401",
        "name": "孝感"
      },
      {
        "code": "101200501",
        "name": "黄冈"
      },
      {
        "code": "101200601",
        "name": "黄石"
      },
      {
        "code": "101200701",
        "name": "咸宁"
      },
      {
        "code": "101200801",
        "name": "荆州"
      },
      {
        "code": "101200901",
        "name": "宜昌"
      },
      {
        "code": "101201001",
        "name": "恩施"
      },
      {
        "code": "101201101",
        "name": "十堰"
      },
      {
        "code": "101201201",
        "name": "神农架"
      },
      {
        "code": "101201301",
        "name": "随州"
      },
      {
        "code": "101201401",
        "name": "荆门"
      },
      {
        "code": "101201406",
        "name": "荆州"
      },
      {
        "code": "101201501",
        "name": "天门"
      },
      {
        "code": "101201601",
        "name": "仙桃"
      },
      {
        "code": "101201701",
        "name": "潜江"
      }
    ],
    "code": "101200101",
    "name": "湖北"
  },
  {
    "cities": [
      {
        "code": "101210101",
        "name": "杭州"
      },
      {
        "code": "101210201",
        "name": "湖州"
      },
      {
        "code": "101210301",
        "name": "嘉兴"
      },
      {
        "code": "101210401",
        "name": "宁波"
      },
      {
        "code": "101210501",
        "name": "绍兴"
      },
      {
        "code": "101210601",
        "name": "台州"
      },
      {
        "code": "101210701",
        "name": "温州"
      },
      {
        "code": "101210801",
        "name": "丽水"
      },
      {
        "code": "101210901",
        "name": "金华"
      },
      {
        "code": "101211001",
        "name": "衢州"
      },
      {
        "code": "101211101",
        "name": "舟山"
      }
    ],
    "code": "101210101",
    "name": "浙江"
  },
  {
    "cities": [
      {
        "code": "101220101",
        "name": "合肥"
      },
      {
        "code": "101220201",
        "name": "蚌埠"
      },
      {
        "code": "101220301",
        "name": "芜湖"
      },
      {
        "code": "101220401",
        "name": "淮南"
      },
      {
        "code": "101220501",
        "name": "马鞍山"
      },
      {
        "code": "101220601",
        "name": "安庆"
      },
      {
        "code": "101220701",
        "name": "宿州"
      },
      {
        "code": "101220801",
        "name": "阜阳"
      },
      {
        "code": "101220901",
        "name": "亳州"
      },
      {
        "code": "101221001",
        "name": "黄山"
      },
      {
        "code": "101221101",
        "name": "滁州"
      },
      {
        "code": "101221201",
        "name": "淮北"
      },
      {
        "code": "101221301",
        "name": "铜陵"
      },
      {
        "code": "101221401",
        "name": "宣城"
      },
      {
        "code": "101221501",
        "name": "六安"
      },
      {
        "code": "101221601",
        "name": "巢湖"
      },
      {
        "code": "101221701",
        "name": "池州"
      }
    ],
    "code": "101220101",
    "name": "安徽"
  },
  {
    "cities": [
      {
        "code": "101230101",
        "name": "福州"
      },
      {
        "code": "101230201",
        "name": "厦门"
      },
      {
        "code": "101230301",
        "name": "宁德"
      },
      {
        "code": "101230401",
        "name": "莆田"
      },
      {
        "code": "101230501",
        "name": "泉州"
      },
      {
        "code": "101230601",
        "name": "漳州"
      },
      {
        "code": "101230701",
        "name": "龙岩"
      },
      {
        "code": "101230801",
        "name": "三明"
      },
      {
        "code": "101230901",
        "name": "南平"
      },
      {
        "code": "101231001",
        "name": "钓鱼岛"
      }
    ],
    "code": "101230101",
    "name": "福建"
  },
  {
    "cities": [
      {
        "code": "101240101",
        "name": "南昌"
      },
      {
        "code": "101240201",
        "name": "九江"
      },
      {
        "code": "101240301",
        "name": "上饶"
      },
      {
        "code": "101240401",
        "name": "抚州"
      },
      {
        "code": "101240501",
        "name": "宜春"
      },
      {
        "code": "101240601",
        "name": "吉安"
      },
      {
        "code": "101240701",
        "name": "赣州"
      },
      {
        "code": "101240801",
        "name": "景德镇"
      },
      {
        "code": "101240901",
        "name": "萍乡"
      },
      {
        "code": "101241001",
        "name": "新余"
      },
      {
        "code": "101241101",
        "name": "鹰潭"
      }
    ],
    "code": "101240101",
    "name": "江西"
  },
  {
    "cities": [
      {
        "code": "101250101",
        "name": "长沙"
      },
      {
        "code": "101250201",
        "name": "湘潭"
      },
      {
        "code": "101250301",
        "name": "株洲"
      },
      {
        "code": "101250401",
        "name": "衡阳"
      },
      {
        "code": "101250501",
        "name": "郴州"
      },
      {
        "code": "101250601",
        "name": "常德"
      },
      {
        "code": "101250700",
        "name": "益阳"
      },
      {
        "code": "101250801",
        "name": "娄底"
      },
      {
        "code": "101250901",
        "name": "邵阳"
      },
      {
        "code": "101251001",
        "name": "岳阳"
      },
      {
        "code": "101251101",
        "name": "张家界"
      },
      {
        "code": "101251201",
        "name": "怀化"
      },
      {
        "code": "101251401",
        "name": "永州"
      },
      {
        "code": "101251501",
        "name": "湘西"
      }
    ],
    "code": "101250101",
    "name": "湖南"
  },
  {
    "cities": [
      {
        "code": "101260101",
        "name": "贵阳"
      },
      {
        "code": "101260201",
        "name": "遵义"
      },
      {
        "code": "101260301",
        "name": "安顺"
      },
      {
        "code": "101260401",
        "name": "黔南"
      },
      {
        "code": "101260501",
        "name": "黔东南"
      },
      {
        "code": "101260601",
        "name": "铜仁"
      },
      {
        "code": "101260701",
        "name": "毕节"
      },
      {
        "code": "101260801",
        "name": "六盘水"
      },
      {
        "code": "101260901",
        "name": "黔西南"
      }
    ],
    "code": "101260101",
    "name": "贵州"
  },
  {
    "cities": [
      {
        "code": "101270101",
        "name": "成都"
      },
      {
        "code": "101270201",
        "name": "攀枝花"
      },
      {
        "code": "101270301",
        "name": "自贡"
      },
      {
        "code": "101270401",
        "name": "绵阳"
      },
      {
        "code": "101270501",
        "name": "南充"
      },
      {
        "code": "101270601",
        "name": "达州"
      },
      {
        "code": "101270701",
        "name": "遂宁"
      },
      {
        "code": "101270801",
        "name": "广安"
      },
      {
        "code": "101270901",
        "name": "巴中"
      },
      {
        "code": "101271001",
        "name": "泸州"
      },
      {
        "code": "101271101",
        "name": "宜宾"
      },
      {
        "code": "101271201",
        "name": "内江"
      },
      {
        "code": "101271301",
        "name": "资阳"
      },
      {
        "code": "101271401",
        "name": "乐山"
      },
      {
        "code": "101271501",
        "name": "眉山"
      },
      {
        "code": "101271601",
        "name": "凉山"
      },
      {
        "code": "101271701",
        "name": "雅安"
      },
      {
        "code": "101271801",
        "name": "甘孜"
      },
      {
        "code": "101271901",
        "name": "阿坝"
      },
      {
        "code": "101272001",
        "name": "德阳"
      },
      {
        "code": "101272101",
        "name": "广元"
      }
    ],
    "code": "101270101",
    "name": "四川"
  },
  {
    "cities": [
      {
        "code": "101280101",
        "name": "广州"
      },
      {
        "code": "101280201",
        "name": "韶关"
      },
      {
        "code": "101280301",
        "name": "惠州"
      },
      {
        "code": "101280401",
        "name": "梅州"
      },
      {
        "code": "101280501",
        "name": "汕头"
      },
      {
        "code": "101280601",
        "name": "深圳"
      },
      {
        "code": "101280701",
        "name": "珠海"
      },
      {
        "code": "101280800",
        "name": "佛山"
      },
      {
        "code": "101280901",
        "name": "肇庆"
      },
      {
        "code": "101281001",
        "name": "湛江"
      },
      {
        "code": "101281101",
        "name": "江门"
      },
      {
        "code": "101281201",
        "name": "河源"
      },
      {
        "code": "101281301",
        "name": "清远"
      },
      {
        "code": "101281401",
        "name": "云浮"
      },
      {
        "code": "101281501",
        "name": "潮州"
      },
      {
        "code": "101281601",
        "name": "东莞"
      },
      {
        "code": "101281701",
        "name": "中山"
      },
      {
        "code": "101281801",
        "name": "阳江"
      },
      {
        "code": "101281901",
        "name": "揭阳"
      },
      {
        "code": "101282001",
        "name": "茂名"
      },
      {
        "code": "101282101",
        "name": "汕尾"
      }
    ],
    "code": "101280101",
    "name": "广东"
  },
  {
    "cities": [
      {
        "code": "101290101",
        "name": "昆明"
      },
      {
        "code": "101290201",
        "name": "大理"
      },
      {
        "code": "101290301",
        "name": "红河"
      },
      {
        "code": "101290401",
        "name": "曲靖"
      },
      {
        "code": "101290501",
        "name": "保山"
      },
      {
        "code": "101290601",
        "name": "文山"
      },
      {
        "code": "101290701",
        "name": "玉溪"
      },
      {
        "code": "101290801",
        "name": "楚雄"
      },
      {
        "code": "101290901",
        "name": "普洱"
      },
      {
        "code": "101291001",
        "name": "昭通"
      },
      {
        "code": "101291101",
        "name": "临沧"
      },
      {
        "code": "101291201",
        "name": "怒江"
      },
      {
        "code": "101291301",
        "name": "迪庆"
      },
      {
        "code": "101291401",
        "name": "丽江"
      },
      {
        "code": "101291501",
        "name": "德宏"
      },
      {
        "code": "101291601",
        "name": "西双版纳"
      }
    ],
    "code": "101290101",
    "name": "云南"
  },
  {
    "cities": [
      {
        "code": "101300101",
        "name": "南宁"
      },
      {
        "code": "101300201",
        "name": "崇左"
      },
      {
        "code": "101300301",
        "name": "柳州"
      },
      {
        "code": "101300401",
        "name": "来宾"
      },
      {
        "code": "101300501",
        "name": "桂林"
      },
      {
        "code": "101300601",
        "name": "梧州"
      },
      {
        "code": "101300701",
        "name": "贺州"
      },
      {
        "code": "101300801",
        "name": "贵港"
      },
      {
        "code": "101300901",
        "name": "玉林"
      },
      {
        "code": "101301001",
        "name": "百色"
      },
      {
        "code": "101301101",
        "name": "钦州"
      },
      {
        "code": "101301201",
        "name": "河池"
      },
      {
        "code": "101301301",
        "name": "北海"
      },
      {
        "code": "101301401",
        "name": "防城港"
      }
    ],
    "code": "101300101",
    "name": "广西"
  },
  {
    "cities": [
      {
        "code": "101310101",
        "name": "海口"
      },
      {
        "code": "101310201",
        "name": "三亚"
      },
      {
        "code": "101310202",
        "name": "东方"
      },
      {
        "code": "101310203",
        "name": "临高"
      },
      {
        "code": "101310204",
        "name": "澄迈"
      },
      {
        "code": "101310205",
        "name": "儋州"
      },
      {
        "code": "101310206",
        "name": "昌江"
      },
      {
        "code": "101310207",
        "name": "白沙"
      },
      {
        "code": "101310208",
        "name": "琼中"
      },
      {
        "code": "101310209",
        "name": "定安"
      },
      {
        "code": "101310210",
        "name": "屯昌"
      },
      {
        "code": "101310211",
        "name": "琼海"
      },
      {
        "code": "101310212",
        "name": "文昌"
      },
      {
        "code": "101310214",
        "name": "保亭"
      },
      {
        "code": "101310215",
        "name": "万宁"
      },
      {
        "code": "101310216",
        "name": "陵水"
      },
      {
        "code": "101310217",
        "name": "西沙"
      },
      {
        "code": "101310220",
        "name": "南沙"
      },
      {
        "code": "101310221",
        "name": "乐东"
      },
      {
        "code": "101310222",
        "name": "五指山"
      }
    ],
    "code": "101310101",
    "name": "海南"
  },
  {
    "cities": [
      {
        "code": "101320101",
        "name": "香港"
      }
    ],
    "code": "101320101",
    "name": "香港"
  },
  {
    "cities": [
      {
        "code": "101330101",
        "name": "澳门"
      }
    ],
    "code": "101330101",
    "name": "澳门"
  },
  {
    "cities": [
      {
        "code": "101340101",
        "name": "台北"
      },
      {
        "code": "101340201",
        "name": "高雄"
      },
      {
        "code": "101340401",
        "name": "台中"
      }
    ],
    "code": "101340101",
    "name": "台湾"
  }
]
